# 1. Синтаксис. Ввод и вывод данных
# Напишите скрипт, который считывает строку с клавиатуры.
# Выведите на экран "привет", если введенная строка совпадает со строкой "привет" или "здравствуйте".
# Если введено что угодно другое, ничего выводить не нужно.

a = input()
greet1 = "привет"
greet2 = "здравствуйте"
if a == greet1:
    print ("привет")
elif a == greet2:
    print ("привет")