# 13. Регулярные выражения. Номер телефона и электронная почта
# Написать функцию, которая на вход принимает строку, а на выход выдает булево значение (True или False),
# которое истинно, если полученная строка соответствует российскому номеру телефона или адресу электронной почты.
#
# Сигнатура функции:
#
# check_string(string) -> bool
#
# Примечания
# Допустимые форматы телефонов. Код страны - всегда либо 7, либо 8, либо +7, либо опущен; код оператора может быть любой:
#
# 89160000000
# +79160000000
# 9160000000
# 8(916)000-00-00
# +7(916)000-00-00
# (916)000-00-00
# 8 (916) 000-00-00
# +7 (916) 000-00-00
# (916) 000-00-00
# 8(916)0000000
# +7(916)0000000
# (916)0000000
# 8-916-000-00-00
# +7-916-000-00-00
# 916-000-00-00

# Валидным адресом электронной почты будем считать строки, содержащие @ и не меньше одной точки (после точки - не меньше двух символов), например:
#
# abc@abc.ab
# abc@abc.ab.ab
# a@ab.ab
# abc.abc@abc.abc
#
# Невалидные адреса:
#
# @abc.abc
# abc@abc
# abc@abc.a
# abc@abc.abc.a
# abc@abc.
# abc@abc@abc

import re

def check_string(string):
    phone = re.sub(r'\b\D', '', string)
    phone_cleared = re.sub(r'[\ \(]?', '', phone)

    if re.findall(r'^[\+7|8|7]*?\d{10}$', phone_cleared) or re.match(r'^\w+[\.]?(\w+)*\@(\w+\.)*\w{2,}$', string):
        return (bool(string))
    else:
        return (False)