# 7. Коллекции. Множества
# С клавиатуры вводится строка, содержащая произвольное количество слов через запятую и пробел.
# Слова могут повторяться.
# Нужно вывести на экран все слова в алфавитном порядке по одному разу, также через пробел и запятую.
# Примечания
# Обратите внимание, что в примере у первого слова "воробей" стоит запятая, а у второго - нет.
# В решении такие случае следует учесть. Кроме того, слова могут быть написаны в разном регистре.
# Вывести их нужно в нижнем регистре. Одинаковые слова, написанные в разных регистрах, считаем одинаковыми.

stroka=input()
stroka_low=stroka.lower()
text = stroka_low.split(", ")
my_set = set(text)
my_set_sorted = sorted(my_set)
print(*my_set_sorted, sep = ", ")